src/test/elements/paypalv2/assets/orders.json

{
  "intent": "order",
  "payer": {
    "payer_info": {
      "email": "paypal-buyer@cloud-elements.com"
    },
    "payment_method": "paypal"
  },
  "redirect_urls": {
    "cancel_url": "https://httpbin.org/get",
    "return_url": "https://httpbin.org/get"
  },
  "transactions": [{
    "amount": {
      "currency": "USD",
      "details": {
        "shipping": "11",
        "subtotal": "30",
        "tax": "0.15"
      },
      "total": "41.15"
    },
    "description": "The payment transaction description.",
    "item_list": {
      "items": [{
          "currency": "USD",
          "name": "<<random.word>>",
          "price": "3",
          "quantity": "5",
          "sku": "1"
        },
        {
          "currency": "USD",
          "name": "<<random.word>>",
          "price": "15",
          "quantity": "1",
          "sku": "product34"
        }
      ],
      "shipping_address": {
        "city": "Redwood City",
        "country_code": "US",
        "line1": "4th Floor, One Lagoon Drive",
        "line2": "Unit #34",
        "phone": "011862212345678",
        "postal_code": "94065",
        "recipient_name": "<<name.firstName>> <<name.lastName>>",
        "state": "CA"
      }
    },
    "payee": {
      "email": "paypal-facilitator@cloud-elements.com"
    }
  }]
}
